app/views/admin/items/new.html.erb

        <label for="item_genre_id", class="create">ジャンル　　　　</label>
        <%= f.collection_select :genre_id, Genre.all, :id, :name %><br>
---
SELECT "genres".* FROM "genres"