app/controllers/admin/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "address" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["address", "テスト用のおうちです"], ["updated_at", "2021-10-27 05:06:22.193099"], ["id", 1]]
---
  def update
    customer = Customer.find(params[:id])
    customer.update(customer_params)