app/controllers/admin/homes_controller.rb

SELECT  "orders".* FROM "orders" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "orders"
---
  def top
    @orders = Order.all.page(params[:page])