app/controllers/admin/items_controller.rb

INSERT INTO "items" ("genre_id", "name", "image_id", "introduction", "price", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    item = Item.new(item_params)
    item.save

SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"
---
  def index
    @items = Item.page(params[:page])