app/views/admin/orders/show.html.erb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
          <tr>
            <% customer_name = @order.customer.last_name + " " + @order.customer.first_name %>