app/views/admin/homes/top.html.erb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders"
SELECT SUM("order_details"."amount") FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
---
              <td><%= link_to order.created_at.strftime('%Y/%m/%d'), admin_order_path(order.id) %></td>
              <td><%= order.customer.last_name order.customer.first_name %></td>
              <td><%= order.order_details.sum(:amount) %></td>