app/views/orders/index.html.erb

SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
---
              <td class="orders-table-border">
                <% order.order_details.each do |order_detail| %>