app/controllers/addresses_controller.rb

  def index
    @address = Address.new
    @addresses = Address.all
---
SELECT "addresses".* FROM "addresses"

  def create
    address = Address.new(address_params)
    address.customer_id = current_customer.id
    address.save
---
INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 1], ["name", "四月一日さん"], ["postal_code", "0000000"], ["address", "テスト用のおうちにゅー"], ["created_at", "2021-10-24 03:23:11.667377"], ["updated_at", "2021-10-24 03:23:11.667377"]]