app/controllers/cart_items_controller.rb

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["customer_id", 1], ["item_id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 5], ["updated_at", "2021-10-23 14:04:41.657146"], ["id", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 5], ["updated_at", "2021-10-23 13:36:15.832837"], ["id", 1]]
INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 1], ["customer_id", 1], ["amount", 2], ["created_at", "2021-10-23 14:12:02.338887"], ["updated_at", "2021-10-23 14:12:02.338887"]]
---
  def create
    cart_item = CartItem.new(cart_item_params)
    cart_items = current_customer.cart_items
    cart_item_base = cart_items.find_by(item_id: cart_item.item.id)
    if cart_item_base
      cart_item_base.amount = cart_item_base.amount + cart_item.amount
      cart_item_base.save
      redirect_to cart_items_path
    else
      cart_item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 4], ["updated_at", "2021-10-28 09:31:15.647757"], ["id", 20]]
---
  def update
    cart_item = CartItem.find(params[:id])
    cart_item.update(cart_item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 3]]
---
  def destroy
    cart_item = CartItem.find(params[:id])
    cart_item.destroy

DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]
---
  def destroy_all
    cart_items = current_customer.cart_items
    cart_items.destroy_all