app/controllers/homes_controller.rb

  def top
    @genres = Genre.all
    @items = Item.last(4)
---
SELECT "genres".* FROM "genres"
SELECT  "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT ?  [["LIMIT", 4]]