app/controllers/items_controller.rb

SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"
---
  def index
    @items = Item.page(params[:page]).per(8)
    @item_count = Item.all.count

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."genre_id" = ? LIMIT ? OFFSET ?  [["genre_id", 1], ["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items" WHERE "items"."genre_id" = ?  [["genre_id", 1]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "items" WHERE "items"."genre_id" = ? LIMIT ? OFFSET ?) subquery_for_count  [["genre_id", 1], ["LIMIT", 8], ["OFFSET", 0]]
---
  def genre_finding
    genre = Genre.find(params[:genre_id])
    items = genre.items
    @items = items.page(params[:page]).per(8)
    @item_count = items.count