app/controllers/orders_controller.rb

DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 5]]
---
  def create
    @order.save
    current_customer.cart_items.destroy_all