app/controllers/orders_controller.rb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ?  [["customer_id", 1]]
---
  def new
    cart_items = current_customer.cart_items
    if cart_items == []
      redirect_to cart_items_path
    end
    @order = Order.new
    postal_values = current_customer.addresses
    @postal_value_list = {}
    postal_values.each do |postal_value|

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
---
  def confirm
    @order = Order.new(order_params)
    if params[:order][:radio_number] == "1"
      @order.postal_code = current_customer.postal_code
      @order.address = current_customer.address
      @order.name = current_customer.last_name + current_customer.first_name
    elsif params[:order][:radio_number] == "2"
      address = Address.find(params[:order][:select_address])
      @order.postal_code = address.postal_code
      @order.address = address.address
      @order.name = address.name
    end
    @cart_items = current_customer.cart_items
    billing =[]
    @cart_items.each do |cart_item|

INSERT INTO "orders" ("customer_id", "postal_code", "address", "name", "postage", "billing", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
INSERT INTO "order_details" ("order_id", "item_id", "amount", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 13], ["item_id", 1], ["amount", 3], ["price", 4430], ["created_at", "2021-10-28 10:03:34.982804"], ["updated_at", "2021-10-28 10:03:34.982804"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 32]]
---
  def create
    confirm = Order.new(order_params)
    confirm.customer_id = current_customer.id
    if confirm.save
      cart_items = current_customer.cart_items
      cart_items.each do |cart_item|
        order_detail = OrderDetail.new
        order_detail.order_id = confirm.id
        order_detail.item_id = cart_item.item.id
        order_detail.amount = cart_item.amount
        order_detail.price = confirm.billing
        order_detail.save
      end
      current_customer.cart_items.destroy_all

SELECT  "orders".* FROM "orders" WHERE "orders"."customer_id" = ? ORDER BY "orders"."id" DESC LIMIT ?  [["customer_id", 1], ["LIMIT", 1]]
---
  def index
    @orders = current_customer.orders

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @order = Order.find(params[:id])
    @order_details = @order.order_details